new-handout/clustering-trees/handout-clustering.tex
% Created 2014-11-03 Mon 16:51
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{minted}
\usepackage{hyperref}
\tolerance=1000
\author{Paul Magwene}
\date{\today}
\title{Bio 723: Clustering I}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Dissimilarity measures}
\label{sec-1}

\subsection{Dissimilarity measures in R}
\label{sec-1-1}

R includes a function, \verb~dist()~, for calculating some of the most basic dissimilarity measures including Euclidean, Minkowski, and Manhattan metrics among others. The typical input to \verb~dist()~ is a data frame or matrix and a \verb~method~ argument specifying the type of distance measure to use. The \verb~upper~ argument specifies whether the upper diagonal of the calculated distance matrix should be printed (by default only the lower diagonal is printed).

To start with let's create a small $4 \times 3$ matrix where we can easily calculate the distances between the 4 points by pencil and paper.

\begin{minted}[]{r}
# create a 4 x 3 matrix
z <- matrix(c(0,0,0,
              1,0,0,
              0,1,0,
              0,0,1), 4, 3, byrow=T)
dist(z)
\end{minted}

\begin{verbatim}
         1        2        3
2 1.000000                  
3 1.000000 1.414214         
4 1.000000 1.414214 1.414214
\end{verbatim}

The default distance measure is Euclidean distance.  Let's apply Manhattan distance to the same matrix.

\begin{minted}[]{r}
dist(z, method='manhattan')
\end{minted}

\begin{verbatim}
  1 2 3
2 1    
3 1 2  
4 1 2 2
\end{verbatim}

\subsection{Dissimilarity Measures in Python}
\label{sec-1-2}

\begin{minted}[]{python}
import numpy as np # import numpy

z = np.matrix([[0,0,0],
               [1,0,0],
               [0,1,0],
               [0,0,1]], dtype=np.float)
z
\end{minted}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
